Lexhunger/Eldra-v2/sdkconfig.defaults
# ESP-IDF SDK configuration for Waveshare ESP32-S3 2.8" Round Display
# Target: ESP32-S3

# Target selection
CONFIG_IDF_TARGET="esp32s3"

# Flash size
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# PSRAM support (required for frame buffer)
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Partition table
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# FreeRTOS
CONFIG_FREERTOS_HZ=1000

# Log level
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_LOG_DEFAULT_LEVEL=3

# LCD
CONFIG_LCD_RGB_ISR_IRAM_SAFE=y

# Heap
CONFIG_HEAP_PLACE_FUNCTION_INTO_FLASH=y
